Revit 2024 API
RebarShapeConstraintRadius Properties
The RebarShapeConstraintRadius type exposes the following members.
Properties
Name | Description
ArcReferenceType
 The choice of rule for measuring the radius.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RebarShapeConstraint.)
See Also
RebarShapeConstraintRadius Class
Autodesk.Revit.DB.Structure Namespace